#+TITLE: Practicando recursión usando first y rest (Ejercicios) 
#+PROPERTY: header-args  :noweb yes 
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup  


* first and rest
  Utilizando la sintaxis de asignación de desestructuración podemos obtener el "primer elemento de un arreglo" 
y "el resto del arreglo". El uso de "first y rest" hace que sea más fácil pensar 
recursivamente. 

#+begin_src js :exports both :results output
let arr = [1,2,3,4]
let [first, ...rest] = arr;

console.log('first: ', first);
console.log('rest:  ', rest);
#+end_src

#+RESULTS:
: first:  1
: rest:   [ 2, 3, 4 ]

